OpenFOAM-v2506/tutorials/incompressible/pisoFoam/RAS/cavity/system/FOs/FOsurfaceDistance
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

surfaceDistance1
{
    // Mandatory entries
    type            surfaceDistance;
    libs            (fieldFunctionObjects);
    geometry
    {
        pending.obj
        {
            type triSurfaceMesh;
            name pending;
        }
    }

    // Optional entries
    calculateCells  true;

    // Optional (inherited) entries
    region          region0;
    enabled         true;
    log             true;
    timeStart       0;
    timeEnd         1000;
    executeControl  writeTime;
    executeInterval -1;
    writeControl    writeTime;
    writeInterval   -1;
}


// ************************************************************************* //
